import sympy as sp
import os

os.system('cls') 

x = sp.symbols("x")

func  = sp.sin(x)**2 - sp.cos(x)**2

print(f"1) корни уравнеия :{sp.solve(func,x)}")
print(f"==================================================")
print(f"2) интервал где (f(x) > 0): {sp.solve(func > 0)}")
print(f"==================================================")
print(f"3) интервал где (f(x) < 0): {sp.solve(func < 0)}")
print(f"==================================================")
print(f"4) график {func}")
sp.plot(func,(x,-3,3))
print(f"==================================================")
print(f"5) вершины (f'(x) = 0): {sp.solve(sp.diff(func,x),x)}")
print(f"==================================================")
print(f"6) промежутки, на котором (f(x) > 0): {sp.solve(func > 0)}")
print(f"==================================================")
print(f"7) промежутки, на котором (f(x) < 0): {sp.solve(func < 0)}")
print(f"==================================================")